Repository: NuTyX/cards
Catalog: po/*.po
Languages: fr

source: 033[1;33musage: 033[1;0m
fr: 033[1;33mutilisation: 033[1;0m

source: 033[1;33mrequired033[1;0m
fr: 033[1;33mrequis033[1;0m

source: 033[1;34mcommand033[1;0m
fr: 033[1;34mcommande033[1;0m

source: <arguments> Where
fr: <arguments> Où la

source: No specify command
fr: Aucune commande n'est spécifiée

source: Illegal token: '-'
fr: Tirret illégale: '-'

source: unknown option:
fr: option inconnue:

source: Value required for option '
fr: Une valeur est requise pour l'option '

source: invalid short option '
fr: Option courte invalide '

source: unknown short option:
fr: option courte inconnue:

source: Option required for option '
fr: Option requise pour l'option '

source: Command
fr: La commande

source: requires option
fr: nécessite une option

source: not found
fr: pas trouvé

source: is one of the following:
fr: est une des suivantes:

source: takes at least
fr: prend au moins

source: takes exactly
fr: prend exactement

source: takes at most
fr: prend maximum

source: invalid option
fr: option invalide

source: could not download
fr: ne peut pas télécharger

source: could not created
fr: ne peut pas créer

source: could not open
fr: ne peut pas ouvrir

source: could not find
fr: ne peut pas trouver

source: could not read
fr: ne peut pas lire

source: could not parse
fr: impossible d'analyser

source: could not read directory
fr: ne peut pas lire le dossier

source: could not write file
fr: ne peut pas écrire le fichier

source: could not synchronize
fr: impossible de synchroniser

source: could not rename
fr: impossible de renomer

source: could not copy
fr: impossible de copier

source: could not determine name / build number
fr: impossible de déterminer le nom / la valeur de construction

source: : wrong architecture
fr: : mauvaise architecture

source: empty package
fr: paquet vide

source: fork() failed
fr: erreur lors de la création du nouveau processus

source: Database
fr: Base de données

source: locked by another user
fr: vérouillée par un/une autre utilisateur/utilisatrice

source: could not lock directory
fr: ne peut pas vérouiller le dossier

source: could not remove file
fr: ne peut pas supprimer le fichier

source: could not rename directory
fr: ne peut pas renommer le dossier

source: require one argument
fr: nécessite un argument

source: invalid option
fr: option non valide

source: option missing
fr: option manquante

source: : to many options
fr: : trop d'options

source: this command should not be used under root.
fr: cette commande ne peut pas être utilisée en root.

source: only root can install / upgrade / remove packages
fr: seul l'utilisateur root peut installer / mettre à jour / supprimer des paquets

source: only root can install / sync / purge / upgrade / remove packages
fr: seul l'utilisateur root peut installer / synchroniser / purger / mettre à jour / supprimer des paquets

source: already installed (use -u to upgrade)
fr: déjà installé (utilisez -u pour le mettre à jour)

source: not yet installed
fr: pas encore installé

source: package
fr: le paquet

source: not previously installed (skip -u to install)
fr: pas installé précédement (supprimez -u pour installer)

source: : listed file(s) already installed (use -f to ignore and overwrite)
fr: : fichier(s) listé(s) déjà installé(s) (utilisez -f pour les ignorer et les remplacer)

source: is in the basesystem (use -f to remove it anyway)
fr: est dans le système de base (utilisez -f pour le supprimer malgré les risques.)

source: : line too long, aborting
fr: : ligne trop longue, abandon

source: : wrong number of arguments, aborting
fr: : nombre d'arguments incorrect, abandon

source: ': config unknown action, should be YES or NO, aborting
fr: ': action de config inconnue, doit être YES ou NO, abandon

source: ' unknown event, aborting
fr: ' évenement inconnu, abandon

source: error compiling regular expression '
fr: erreur de compilation d'une expression régulière '

source: ', aborting
fr: ', abandon

source: is neither an installed package nor a package file
fr: n'est pas un paquet installé ni une archive cards

source: The package
fr: Le paquet

source: is already installed
fr: est déjà installé

source: does not exist
fr: n'existe pas

source: is in use
fr: est utilisé

source: You are not in chroot mode. The file
fr: Vous n'êtes pas en mode chroot. Le fichier

source: is a runtime dependency for
fr: est une dépendance de fonctionnement pour

source: is not found
fr: n'est pas trouvé

source: Retrieve info about the
fr: Obtenir les infos sur les

source: Usage:
fr: Utilisation:

source: packages:
fr: paquets:

source: Package
fr: Paquet

source: <package>
fr: <paquet>

source: Packages
fr: Paquets

source: Package:
fr: Paquet:

source: have a wrong signature.
fr: a une fausse signature.

source: <package> | <collection> | <set>
fr: <paquet> | <collection> | <jeu>

source: File
fr: Fichier

source: Directory:
fr: Dossier:

source: from
fr: depuis

source: Binaries :
fr: Binaires :

source: Base System list directory:
fr: Liste des dossiers pour le système de base:

source: No package found for the base System
fr: Aucun paquet trouvé pour le système de base

source: log directory:
fr: Dossier des logs:

source: pre-install: start
fr: pre-installation: démarrée

source: pre-install: finish
fr: pre-installation: finie

source: post-install: start
fr: post-installation: démarrée

source: post-install: finish
fr: post-installation: finie

source: ADD: (
fr: AJOUTE: (

source: REMOVE: (
fr: SUPPRIME: (

source: files:
fr: fichiers:

source: : could not install
fr: : ne peut pas installer

source: : no owner(s) found
fr: : aucun paquet trouvé

source: could not open the archive
fr: Impossible d'ouvrir l'archive

source: could not read the archive
fr: Impossible de lire l'archive

source: Invalid meta data in file
fr: Données méta invalides dans le fichier

source: Invalid mtree in file
fr: Arbre Mtree invalide dans le fichier

source: is not an archive
fr: n'est pas une archive

source: is not a CARDS archive
fr: n'est pas une archive CARDS

source: : invalid architecture
fr: : architecture invalide

source: Not found
fr: Pas trouvé

source: Print this help message
fr: Affiche cet aide

source: Name:
fr: Nom:

source: Installed:
fr: Interne:

source: Available:
fr: Disponible:

source: To remove:
fr: A supprimer:

source: Status:
fr: Etat:

source: Yes
fr: Oui

source: day(s)
fr: jour(s)

source: Name :
fr: Nom :

source: Alias :
fr: Aussi appelé :

source: Sets :
fr: Jeux de paquets :

source: Categories :
fr: Catégories :

source: Group :
fr: Groupe :

source: Groups :
fr: Groupes :

source: Binary URL :
fr: URL binaires :

source: Date of Pkgfile:
fr: Date du Pkgfile :

source: Local folder :
fr: Dossier local :

source: Archive name :
fr: Nom de l'archive :

source: Hashsum :
fr: Somme hash :

source: Archive Size :
fr: Taille de l'archive :

source: Contributor(s) :
fr: Contributeur(s) :

source: Maintainer(s) :
fr: Mainteneur(s) :

source: Packager :
fr: Empaqueteur :

source: Build date :
fr: Date de construction:

source: Installed date :
fr: Date d'installation :

source: Installed Size :
fr: Taille installée :

source: bytes
fr: octets

source: Number of Files:
fr: Nombre de fichiers :

source: file(s)
fr: fichier(s)

source: Man. installed : Yes
fr: Install. manuelle : Oui

source: Man. installed : No
fr: Install. manuelle : Non

source: Dependencies :
fr: Dépendances :

source: list of installed packages
fr: liste les paquets installés

source: number of installed packages
fr: nombre de paquets installés

source: list details about the <package>
fr: liste les détails du <paquet>

source: list files in <package> or <file>
fr: liste les fichiers du <paquet> ou <fichier>

source: do not execute pre/post install scripts
fr: ne pas exécuter les scripts de pré/post installation

source: upgrade package with the same name
fr: met à jour le paquet avec le même nom

source: force install, overwrite conflicting files
fr: force l'installation, remplace les fichiers déjà installés par un autre paquet

source: list all the runtime libraries for the <package>
fr: liste toutes les librairies utilisées par le paquet <package>

source: list owner(s) of file(s) matching <pattern>
fr: liste les fichiers et le paquet d'appartenance correspondant à la chaîne <pattern>

source: WARNING Run post-install FAILED, continue
fr: AVERTISSEMENT l'exécution de la post-intallation a échoué, le processus continue

source: print footprint for <file>
fr: affiche la liste des fichiers contenu dans le fichier <fichier>

source: return the build time of the package
fr: renvoit la date de construction du paquet

source: print Name, Version, Release, BuildDate and Deps of the <file>
fr: affiche le nom, la version, la release, la date de construction et les dépendances de fonctionnement du fichier <fichier>

source: return on a single line all the runtime dependencies
fr: renvoit toutes les dépendances utilisées pour le fonctionnement du paquet sur une seule ligne

source: return on a single line all the runtime dependencies for the files found in the <path>
fr: renvoit toutes les dépendances utilisées pour le fonctionnement des fichiers trouvés dans le chemin <chemin>

source: specify alternative installation root
fr: spécifie un chemin alternatif à la racine de l'installation

source: print version and exit
fr: affiche la version et quitte l'application

source: print help and exit
fr: affiche l'aide et quitte l'application

source: command
fr: commande

source: Where possible
fr: Où la

source: is:
fr: possible est:

source: show this help
fr: affiche cet aide

source: Available binaries in depot.
fr: Binaires disponibles dans les dépots.

source: Available sets of packages.
fr: Jeux de paquets disponibles.

source: Available ports.
fr: Ports disponibles.

source: print info about install package
fr: affiche les détails d'information du paquet

source: show the configuration of your
fr: affiche la configuration de votre

source: show all the ports founds. The list is showned by order of compilation
fr: affiche tous les ports trouvés. La liste est affichée par ordre de compilation

source: If -I it will ignore the WARNING about NOT FOUND <dependencies> from <port>
fr: Si -I il ignore les WARNING à propos des dépendances non trouvées du port (NOT FOUND <dependencies> from <port>)

source: show dependencies for the port in compilation order.
fr: affiche les dépendances du port par ordre de compilation

source: show reverse dependencies list that needs the port.
fr: affiche la liste des dépendances inverses qui utilisent le port.

source: generates the keys pair for the signature of the packages.
fr: génère la paire de clés pour la signature des paquets

source: If -i it will shows the installed dependencies as well.
fr: Si -i affiche également les dépendances déjà installées.

source: show dependencies in a tree.
fr: affiche les dépendances dans un arbre descendant.

source: compile and install the port and its dependencies.
fr: compile et installe le port et ses dependances.

source: install all the dependencies from binaries and then compile the port.
fr: installe toutes les dépendances depuis les binaires et compile le port à la fin.

source: check or signing a collection of packages depending if a private key is present.
fr: vérifie ou signe une collection de paquets en fonction de la présence d'une clé privée.

source: shows available updates.
fr: affiche les mise à jour disponibles.

source: Shows Out of date, Obsolet, Rebuild, Conflict, Replace packages available.
fr: Affiche les paquets disponibles qu'ils soient périmés, Obsolètes, reconstruits, en conflit ou remplaçables.

source: upgrade outdated packages.
fr: met à jour les paquets obsolètes.

source: cleanup downloaded binaries in cache.
fr: supprime les binaires téléchargés dans le cache.

source: show port names or description containing 'expr'
fr: affiche le nom ou la description du port contenant l'expression 'expr'

source: list owner of file(s) matching the query.
fr: liste les fichiers et le paquet d'appartenance correspondant à la requête.

source: list the file(s) owned by the <package>
fr: liste le(s) fichier(s) appartenant(s) au paquet <paquet>

source: synchronize the local and remote meta datas.
fr: synchronise les metadonnées locales et distantes

source: install the binary found on the mirror.
fr: installe le binaire trouvé sur le serveur.

source: If -b it will search in the repository cache.
fr: Si -b, la recherche se fait dans les paquets disponibles sur le serveur.

source: If -n it will search in the name of the available packages only.
fr: Si -n, la recherche se fait dans le nom des paquets disponibles uniquement.

source: If -u it will upgrade the installed package.
fr: Si -u, met à jour le paquet installé.

source: If -f it will force the installation in case of files conflicts.
fr: Si -f, force l'installation du paquet en cas de fichier(s) en double.

source: remove the installed package.
fr: supprime le paquet installé.

source: If -a it will remove the sub-package as well.
fr: Si -a, supprime également les sous-paquets.

source: shows help about cards.
fr: affiche l'aide de cards.

source: You can also check 'man cards', 'man cards.conf', 'man pkgmk', 'man pkgmk.conf'.
fr: Vous pouvez aussi lire 'man cards', 'man cards.conf', 'man pkgmk', 'man pkgmk.conf'.

source: print info about cards configuration.
fr: affiche les informations de la configuration de cards.

source: list the file(s) of the <package>.
fr: Affiche le(s) fichier(s) du <paquet>.

source: synchronize local and remote metadatas.
fr: synchronise les metadonnées locales et distantes.

source: print info about a package.
fr: affiche les informations d'un paquet

source: print all details of a package like version, size, description, etc.
fr: affiche tous les détails d'un paquet tel que la version, la taille, la description, etc.

source: list all packages.
fr: affiche une liste de tous les paquets

source: It will list available packages.
fr: Affiche une liste de tous les paquets disponibles.

source: Available sets of packages in depot server.
fr: Jeux de paquets disponibles sur le serveur de dépot.

source: If -p or -b are passed as optional arguments, it will be the info of a port or the info of a binary available in the depot.
fr: Si un argument -p ou -b est utilisé, ce seront les informations d'un port ou les informations d'un binaire disponible sur le dépot.

source: list installed packages by the user.
fr: Liste des paquets installés par l'utilisateur.

source: install one or more <package>, a <file> or a <collection>.
fr: installe un ou plusieurs <paquet>, <fichier> ou <collection>.

source: remove one or more packages or a complete collection.
fr: supprime un ou plusieurs paquets ou une collection complète.

source: generate all the levels.
fr: génère tous les niveaux.

source: verify/generate locale repositories meta data.
fr: vérifie/génère les méta données des dépots.

source: list the dependencies of the port.
fr: liste les dépendances du port.

source: list the dependencies tree of the port.
fr: liste les dépendances du port sous forme d'arbre.

source: search for <expr>.
fr: recherche l'<expression>.

source: create a package AND it's dependencies from the recipe found in the ports.
fr: crée un paquet ET ses dépendances depuis les recettes trouvées dans les ports.

source: create a package from the recipe found in the port.
fr: crée un paquet unique depuis la recette trouvée dans le port.

source: list of ports using this port.
fr: liste les ports utilisant ce port.

source: generate the keys pair.
fr: génère la paire de clés.

source: remove archives from installed packages.
fr: supprime les archives des paquets qui ont été installés.

source: upgrade you installation with a single command.
fr: met à jour votre installation avec une seule commande.

source: It's mainly use to know if they are no duplicate call of any dependency.
fr: Principalement utilisé pour savoir si il n'y a pas certaines dépendances en double.

source: Force the action.
fr: Force l'action.

source: Upgrade the package with the same name.
fr: Met à jour le paquet avec le même nom.

source: don't add a log entry for this install set.
fr: n'ajoute aucune entrée log pour ce jeu d'install.

source: Included the allready installed packages in the list.
fr: Inclus dans la liste, les paquets qui sont déjà installés.

source: Full list, including automatically installed packages.
fr: Liste complète, y compris les paquets installés automatiquements

source: Available binaries in depot server.
fr: Binaires disponibles sur le serveur de dépot

source: Local available ports.
fr: Ports disponibles en local.

source: Not doing the action. Only simulate (if possible) what will be done.
fr: Ne pas faire l'action. Seulement simuler (si possible) ce qui sera fait.

source: Remove the packages founds, use with care.
fr: Supprime les paquets trouvés, utiliser avec précaution.

source: Remove the package(s) even if they are in the base list.
fr: Supprime le(s) paquet(s) même si il(s) se trouve(nt) dans la liste de base.

source: Ignore WARNINGS and list the level anyway.
fr: Ignore les WARNINGS et affiche malgré tout la liste des niveaux.

source: Ignore Pre and Post install scripts.
fr: Ignore les scripts de Pré et Post installation.

source: Return the number of updates.
fr: Affiche le nombre de mise à jour disponible.

source: Check if they are some updates.
fr: Vérifie si il y a des mise à jour disponible.

source: Only check if all binaries that are needed are downloaded.
fr: Vérifie uniquement si tous les binaires nécessaires sont téléchargés.

source: Search only in the name of the package.
fr: Recherche uniquement dans le nom du paquet.

source: Don't upgrade local metadata (not recommended).
fr: Ne pas mettre les metadonnées locales à jour (déconseillé).

source: Only download the binaries that are needed to be upgraded.
fr: Télécharge uniquement les binaires nécessaires pour la mise à jour.

source: Specify alternative installation root
fr: Spécifie une racine d'installation alternative (autre que '/').

source: <path>
fr: <chemin>

source: Specify alternative 'cards.conf' configuration file
fr: Spécifie un fichier de configuration 'cards.conf' alternatif

source: <file>
fr: <config>

source: This command can upgrade at onces alls your installed out of date packages.
fr: Cette commande permet de mettre à jour tous vos paquets installés et obsolètes.

source: BUILDING PACKAGES SPECIFIC SCENARIO
fr: SCENARIO SPECIFIQUE A LA CONSTRUCTION DES PAQUETS

source: SEARCHING
fr: RECHERCHE

source: SYNCHRONIZATION
fr: SYNCHRONISATION

source: DIFFERENCES / UPGRADE / CLEANUP
fr: DIFFERENCES / MISE A JOUR / NETTOYAGE

source: INSTALL, UPDATE and REMOVAL
fr: INSTALLER, REMPLACER et SUPPRIMER

source: Your system is up to date.
fr: Votre système est à jour.

source: will be replaced when you upgrade your NuTyX.
fr: seront remplacés lorsque vous mettrez votre NuTyX à jour.

source: will be removed when you upgrade your NuTyX.
fr: seront supprimés lorsque vous mettrez votre NuTyX à jour.

source: have been replaced on your NuTyX.
fr: ont été remplacés sur votre NuTyX.

source: have been removed from your NuTyX.
fr: ont été supprimés sur votre NuTyX.

source: The collection
fr: La collection

source: is part of the minimal system and cannot be removed !!!
fr: fait parti du système minimum et ne peut pas être supprimée !!!

source: Proceed with upgrade and bypass details information.
fr: Procède à la mise à jour sans montrer les détails.

source: Summary:
fr: Résumé:

source: Percentage of obsoletes packages:
fr: Percentage de paquets obsolètes:

source: Use the command:
fr: Utilisez la commande:

source: to see all the details about the upgrade.
fr: pour voir tous les détails concernant cette mise à jour.

source: when you're ready to upgrade your system.
fr: quand vous êtes prêt pour lancer la mise à jour de votre système.

source: Number of Packages:
fr: Nombre de Paquets:

source: Unchanged Packages:
fr: Paquets inchangés:

source: Out of Date Packages (different version):
fr: Paquets périmés (versions différentes):

source: Rebuild Packages (newer build date):
fr: Paquets reconstruits (construction plus récente):

source: Obsoletes Packages (will be removed):
fr: Paquets obsolètes (seront supprimés):

source: Unmaintained Packages (should be remove):
fr: Paquets non maintenus

source: Conflict Packages (will be removed):
fr: Paquets en conflit (seront supprimés):

source: Total download size:
fr: Taille totale du téléchargement:

source: Total size of reinstalled packages:
fr: Taille totale des paquets reinstallés:

source: Total size of remove packages:
fr: Taille totale des paquets supprimé:

source: Total amount of added bytes:
fr: Nombre d'octets ajoutés:

source: Total amount of removed bytes:
fr: Nombre d'octets supprimés:

source: Available space on your system:
fr: Espace disponible sur votre système:
